test/load-test.yml
config:
  target: 'http://localhost:8080/'
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike
  plugins:
    ensure: {}
    apdex: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 200
      - http.response_time.p95: 150
scenarios:
  - flow:
      - loop:
          - get:
              url: '/product/Zayed'
        count: 150